{
  "sections": [
    {
      "title": "The Winds of Winter",
      "level": 1,
      "content": [
        {
          "type": "paragraph",
          "text": "\"The Winds of Winter\" is the tenth and final episode of the sixth season of Game of Thrones. It is the sixtieth episode of the series overall. It premiered on June 26, 2016. It was written by David Benioff & D.B. Weiss and directed by Miguel Sapochnik."
        }
      ],
      "images": []
    },
    {
      "title": "Plot",
      "level": 2,
      "content": [
        {
          "type": "paragraph",
          "text": "Cersei stands trial for her crimes, while Jaime celebrates victory with Walder Frey at The Twins. Davos confronts Jon about Melisandre's actions, and Littlefinger reveals his intentions to Sansa. Meanwhile, Bran continues his quest for knowledge in the far North as \"winter\" finally arrives."
        }
      ],
      "images": []
    },
    {
      "title": "Summary",
      "level": 2,
      "content": [],
      "images": []
    },
    {
      "title": "At the Twins",
      "level": 3,
      "content": [
        {
          "type": "paragraph",
          "text": "Jaime Lannister and Bronn arrive at The Twins to celebrate the regained control of Riverrun and the allegiance between the Freys and the Lannisters. However, Jaime had to ride north from King's Landing in order to retake Riverrun from Blackfish Tully with the persuasion of Edmure Tully. Walder Frey nevertheless crows over his victory and tries to build rapport with Jaime, mentioning that they are both kingslayers. Unamused, Jaime asks him why the Lannisters would need House Frey on their side, when they cannot keep control of the Riverlands."
        },
        {
          "type": "paragraph",
          "text": "Some time later Walder Frey is seen eating dinner in his hall. When one of the servants serves him pie, he does not recognize her and immediately questions who she is, slapping her on the behind. He goes on to gripe about the tardiness of his sons, Black Walder and Lothar Frey, to which the servant earnestly insists that they are already present. Eventually, he opens the pie and reacts in horror: he has been served the flesh of his own sons. The servant removes her face, revealing that she is Arya Stark of Winterfell, come to remind him of his crimes and take revenge. Lord Walder is shocked and tries to escape, but Arya holds him and slits his throat, smiling as she watches the man who murdered her mother and brother bleed to death."
        }
      ],
      "images": [
        {
          "src": "http://vignette3.wikia.nocookie.net/gameofthrones/images/f/fe/Game-of-thrones-season-6-winds-of-winter-image-5.jpeg/revision/latest/scale-to-width-down/180?cb=20160622201446",
          "caption": "Jaime Lannister speaks to Walder Frey."
        }
      ]
    },
    {
      "title": "In King's Landing",
      "level": 3,
      "content": [
        {
          "type": "paragraph",
          "text": "In King's Landing, everyone is getting ready for the trial of Ser Loras Tyrell and Cersei Lannister. The small folk enter the Great Sept of Baelor, along with Queen Margaery Tyrell, Lord Mace Tyrell, and Ser Kevan Lannister. As Grand Maester Pycelle heads to the sept, a small child stops him and whispers something into his ear."
        },
        {
          "type": "paragraph",
          "text": "The Sparrows bring Ser Loras in first, as the High Sparrow awaits. Instead of having a trial, Loras confesses to his crimes and tells the High Sparrow that he wishes to devote his life to the Faith. The High Sparrow tells him that this would mean that he renounces his family name and his future lordship of Highgarden, but Loras tearfully agrees, and the sparrows carve a seven-pointed star into his forehead. Margaery and Mace are unhappy with the High Sparrow for mutilating Loras, but the High Sparrow says he only promised to allow him to leave after Cersei faces her trial."
        },
        {
          "type": "paragraph",
          "text": "King Tommen prepares to depart the Red Keep for the trial of his mother, but Ser Gregor Clegane prevents him from leaving. Lancel tells the High Sparrow that Cersei has yet to leave the Red Keep, so the High Sparrow asks him to go retrieve her. As Lancel is walking out, Arthur lures him away into the area below the Sept. Meanwhile, Pycelle follows Frances, the child from earlier into a room where Qyburn awaits him. Qyburn apologizes to Pycelle for the inconvenience and then multiple children surround Pycelle and begin stabbing him repeatedly to his death."
        },
        {
          "type": "paragraph",
          "text": "Margaery, realizing something is very wrong with the fact that neither Cersei nor Tommen are at the trial, confronts the High Sparrow. She tells him that it's a trap, but he does not listen. Below the Sept, Lancel continues to follow the child, who suddenly stabs him in the spine as Lancel picks up the torch the child dropped. In pain, Lancel discovers a cache of wildfire about to be set off, and slowly starts crawling towards the end of the hall to attempt to put the candles out. Margaery tells everyone in the Sept they need to leave immediately, but the Faith Militant prevent anyone from exiting. Lancel does not make it to the wildfire in time, and the Sept explodes, killing everyone inside and outside of it as well as levelling most of the surrounding area."
        },
        {
          "type": "paragraph",
          "text": "Cersei smiles at the explosion, while Tommen, who is in a different room, is in disbelief. After being informed of the explosion and its casualties, Tommen takes his crown off his head and jumps out of the window to his death."
        },
        {
          "type": "paragraph",
          "text": "Still feeling victorious, Cersei pays a visit to Septa Unella, who has been strapped down. Cersei awakens her by pouring a pitcher of wine on her face as she struggles, and prompts her to confess that she enjoyed tormenting Cersei during her imprisonment, not for the sake of the gods, but because it felt good. Continuing her mockery, Cersei smugly goes down a list, \"confessing\" that she committed her crimes and the massacre of the people in the sept because it all felt good. Finally, Septa Unella stiffly declares that she is not afraid to die. Cersei assures her that her death will last many days, and brings in Ser Gregor Clegane, who removes his helmet and begins to torture her. Walking away and closing the door, Cersei echos the word \"shame\" three times, just as Unella did during Cersei's Walk of Atonement while the Septa screams in horror at her fate."
        },
        {
          "type": "paragraph",
          "text": "After Tommen's body is found, Cersei's triumph is greatly diminished. Standing by his covered remains with Qyburn, she insists on seeing her son's face one last time; then Qyburn asks Cersei what she wants to do about funeral arrangements. She tells him to burn the body and bury the ashes where the Great Sept of Baelor once stood, so that Tommen may rest with his brother, sister, and grandfather."
        },
        {
          "type": "paragraph",
          "text": "Jaime and Bronn arrive back at King's Landing, but their looks of triumph turn to ones of shock and horror as they witness smoke pouring into the air from the ruins of the Great Sept. Jaime soon walks into the throne room just in time to see Cersei seated on the Iron Throne, crowned by Qyburn (who is now her Hand) as Queen of the Seven Kingdoms - or at least, what little of it the Lannisters still control."
        }
      ],
      "images": [
        {
          "src": "http://vignette3.wikia.nocookie.net/gameofthrones/images/0/04/Sept_of_Baelor_Destruction_Wider_Shot%2C_Season_6_Episode_10..jpg/revision/latest/scale-to-width-down/180?cb=20160627161710",
          "caption": "The Sept is blown up with wildfire."
        },
        {
          "src": "http://vignette2.wikia.nocookie.net/gameofthrones/images/1/10/Tommen_Baratheon%28Lannister%29_jumps_out_of_his_window%2C_Season_6_Episode_10..jpg/revision/latest/scale-to-width-down/180?cb=20160627162207",
          "caption": "Tommen commits suicide."
        }
      ]
    },
    {
      "title": "In Oldtown",
      "level": 3,
      "content": [
        {
          "type": "paragraph",
          "text": "Sam, Gilly, and her son finally arrive at Oldtown, spotting the Hightower, with dozens of white ravens released, signalling the arrival of winter."
        },
        {
          "type": "paragraph",
          "text": "After arriving at a bureaucrat's desk in the Citadel, Sam informs the maester he has been sent by the Night's Watch's Lord Commander, Jon Snow, to be trained as a maester. The bureaucrat, maintaining a deadpan expression, is hesitant because Jeor Mormont and Aemon are recorded as Lord Commander and Maester of Castle Black. Sam awkwardly informs him that the two died before ravens could be sent out. While he arranges for Sam to meet with one of the Archmaesters, he allows him access to the Citadel's library, but sharply bars Gilly and her son from following. As Sam explores the library by himself, he is in awe at the vast collection of books and scrolls."
        }
      ],
      "images": [
        {
          "src": "http://vignette1.wikia.nocookie.net/gameofthrones/images/5/5f/Sam_in_tower_library.png/revision/latest/scale-to-width-down/180?cb=20160628035140",
          "caption": "Sam in the Citadel's library."
        }
      ]
    },
    {
      "title": "Beyond the Wall",
      "level": 3,
      "content": [
        {
          "type": "paragraph",
          "text": "Benjen drops Meera and Bran off at grove with a weirwood heart tree in sight of the Wall, as he can go no farther. When Bran asks why, he replies that the magic of the Wall prevents the dead from crossing, such as himself. He plans to do what he can to prepare for the coming war, as he still fights for the living."
        },
        {
          "type": "paragraph",
          "text": "After thanking his uncle, who rides off on his horse, Bran turns his attention to the weirwood tree. Meera expresses doubts on his readiness, but Bran insists that he must be the three-eyed raven, and places his hand on the face carved into the tree. He has another vision of the events at the Tower of Joy, right where he had left off before the old Three-eyed Raven interrupted. Having learned his lesson, Bran does not call after his father, who still turns around briefly before rushing into the Tower. Inside, Ned - followed along by Bran - discovers his sister Lyanna Stark lying in bed with blood-stained sheets, being tended to by a few handmaidens, one of which hands a newborn baby to Ned. A weakened Lyanna whispers to Ned of the baby's identity and makes him promise to keep her child safe, as Robert would kill him should his identity be known. As Ned looks at the newborn child, his eyes open up to reveal dark colored eyes - the same as Jon Snow's."
        }
      ],
      "images": [
        {
          "src": "http://vignette1.wikia.nocookie.net/gameofthrones/images/b/be/The_Winds_of_Winter_22.jpg/revision/latest/scale-to-width-down/180?cb=20160627155838",
          "caption": "Bran sees the vision of his father and Aunt Lyanna."
        }
      ]
    },
    {
      "title": "In the North",
      "level": 3,
      "content": [
        {
          "type": "paragraph",
          "text": "Melisandre and Jon Snow are in Winterfell's main hall, where the latter is reminiscing, when Ser Davos Seaworth angrily strides in and tosses Princess Shireen's burned wooden stag to Melisandre, demanding that she explain herself. At first she is silent, but as Davos loses his composure, admits that she convinced King Stannis Baratheon to sacrifice his own daughter in the service of the Lord of Light. She defends herself by saying that it needed to be done because Stannis's forces were stranded by the snows, and that Shireen's parents made the decision as well. Davos quickly dismisses this defense by pointing out they died anyway, and exclaims that her god is evil and that he loved Shireen Baratheon as his own daughter. Melisandre concedes that she made a mistake. Davos finishes by stating that because of her mistake, not only did an innocent child die for a lost cause, so did many more good soldiers."
        },
        {
          "type": "paragraph",
          "text": "Jon, upon hearing the unpleasant news, asks Melisandre if she has anything to say for herself. She replies that she only followed the Lord of Light and implies that he is also responsible for bringing Jon back to life and insists she can still be of use in the battles to come. Still greatly displeased, Jon tells Melisandre to ride south, or he will hang her as a murderer; Davos adds that he will personally kill her if she ever shows up in the North again."
        },
        {
          "type": "paragraph",
          "text": "As Jon along with Sansa look on Melisandre leaving Winterfell, he tells her that he has had Eddard and Catelyn's master bedroom prepared for her, though she insists that he should have it. Jon remarks that Sansa is the Lady of Winterfell and that thanks to her they are alive and have Winterfell back. Sansa apologizes for not telling him about Littlefinger's Knights of the Vale. He in turn asks Sansa if she trusts Littlefinger, which she firmly denies. With that, Jon tells her that they have to trust each other because the Starks have many enemies, and gently kisses her on the forehead."
        },
        {
          "type": "paragraph",
          "text": "Later, in the godswood, Littlefinger approaches Sansa, who asks him what it is that he wants from her. He admits that he wants the Iron Throne, with her at his side. He moves in to kiss her but she stops him and walks away. Petyr reveals he has openly declared for House Stark. Sansa reminds him that he has declared for other houses in the past, which didn't stop him from serving himself. He contests that that was the past, but he is looking for the future, adding that she is the future of House Stark. Ever insidious, he asks her who the North should rally behind: a trueborn daughter of Ned and Catelyn Stark, or a motherless bastard born in the south. Sansa considers his words, but keeps walking without turning to look at him."
        },
        {
          "type": "paragraph",
          "text": "Afterwards, at the Great Hall of Winterfell, Lord Yohn Royce speaks against allying the Knights of the Vale with wildling invaders. Tormund counters that they were invited into the realm and thus are not invaders. Jon reminds the assembly that the Free Folk fought side by side with the Northmen and the Knights of the Vale and won, then adds that his father used to say true friends are found in the battlefield. Lord Cley Cerwyn argues that with the Boltons defeated, the war is over and that winter has arrived, the coldest one in a thousand years according to the Maesters. He then proposes everyone to ride home and wait out the coming storms. Jon counters that the war is not over and the true enemy doesn't wait out the storm, he brings the storm. The attendants begin to argue among themselves."
        },
        {
          "type": "paragraph",
          "text": "At this, Lyanna Mormont stands up and speaks to Lord Wyman Manderly about how his son was murdered at the Red Wedding, yet he recently refused the Stark summons. She then turns to Lord Robett Glover and reminds him how he swore an oath to House Stark, yet refused to aid them in their hour of greatest need. Finally, she confronts Lord Cley Cerwyn, and reminds him that his father was flayed alive by Ramsay Bolton, yet he also refused to aid the Starks. She then adds that both House Mormont and the North remember they have no king but the King in the North, whose name is Stark. She doesn't care that Jon Snow is a bastard, for he has the blood of Ned Stark; thus he is her king until his death."
        },
        {
          "type": "paragraph",
          "text": "The attendants begin to quietly discuss, until Lord Wyman stands up, admitting that Lady Mormont speaks harshly but truly; then adds that, after his son died for the Young Wolf, he ignored Jon's summons to keep more Manderlys from dying for a lost cause but that he was wrong: Jon has avenged the Red Wedding; he is the \"White Wolf,\" the King in the North. He bares his sword and kneels. Lord Robett is the next one to stand up, stating his regret for not fighting besides Jon and asking for forgiveness. Jon humbly says that there is nothing to forgive. Lord Glover turns to the rest of the lords, announcing there will be more fights to come, and that House Glover will stand behind House Stark as it had for a thousand years. He also bares his sword and kneels, hailing Jon as the King in the North. Inspired, the rest of the assembly stands up, following the example and hailing Jon as King in the North - as the northern and riverlords had done for Robb some years ago. Even Davos joins, declaring his allegiance. Pleased, Lady Mormont watches her elder, male counterparts and cheers. Jon stands up, impressed, sharing a look with a smiling Sansa. However, Sansa's smile fades as Littlefinger looks at her sinisterly."
        }
      ],
      "images": [
        {
          "src": "http://vignette4.wikia.nocookie.net/gameofthrones/images/7/70/The_Winds_of_Winter_20.jpg/revision/latest/scale-to-width-down/180?cb=20160627155837",
          "caption": "Melisandre is told to leave and never to return."
        },
        {
          "src": "http://vignette4.wikia.nocookie.net/gameofthrones/images/f/f0/Jon_Snow_is_declared_King_in_The_North_Season_6_Episode_10_Preview..jpg/revision/latest/scale-to-width-down/180?cb=20160627155634",
          "caption": "Jon becomes the King of the North."
        }
      ]
    },
    {
      "title": "In Dorne",
      "level": 3,
      "content": [
        {
          "type": "paragraph",
          "text": "Ellaria and the Sand Snakes meet with Olenna Tyrell, who is now in mourning after the deaths of her son and grandchildren. After the Queen of Thorns shuts down the Sand Snakes' attempts to speak, Ellaria suggests that they must work together for survival, as Cersei has declared war on both of their factions. Olenna clarifies that her House's future has been taken from her; survival is not what she is after now. Delighted, Ellaria promises that an alliance with them will give Olenna her new heart's desire. When Olenna sardonically asks what that is, Ellaria states that it is justice and vengeance. At that moment, Varys reveals himself, and rephrases: \"Fire and Blood.\""
        }
      ],
      "images": []
    },
    {
      "title": "In Meereen",
      "level": 3,
      "content": [
        {
          "type": "paragraph",
          "text": "Daario Naharis meets Queen Daenerys Targaryen, reporting that the fleet is nearly ready. He's eager to see how the Dothraki do on the open sea. Daenerys says that Daario won't be joining them, which Daario interprets to mean that he will go on to seize Casterly Rock to cut off the Lannister retreat. Dany clarifies that Daario is to stay in Meereen with the Second Sons, to keep the peace until the city can safely choose its own ruler. Futhermore, she cannot bring her lover to Westeros, as marriage is still her most valuable bargaining chip when considering new alliances. Daario begs her to take him, pointing out that kings have lovers on the side all the time, and queens should be no different, but Danerys stands firm. Daario realizes that the dwarf put her up to dumping him, but admits that it's politically a good move. Full of self-pity, he muses that no woman could ever compare to the Mother of Dragons, although she is sure he will have many more lovers. Daenerys assures him that she'll leave specific instructions for him to follow in governing the renamed Bay of Dragons. Daario takes his leave."
        },
        {
          "type": "paragraph",
          "text": "When he departs, she goes to see Tyrion, who unsuccessfully tries to console her. Dany thanks him, but admits that she is not upset about Daario; rather, she was frightened that she was able to dismiss someone who loves her so much so easily. Tyrion says that Daario wasn't the first man to love Daenerys, and won't be the last. Dany then turns the topic to Tyrion's rule of Meereen in her absence. He then says that he gave up on believing in himself or in anyone or anything else, but that he believes in her. Touched, Daenerys gives Tyrion a pin she had made for him: the brooch of the Hand of the Queen. Tyrion, struck with emotion, proceeds to kneel in front of her."
        },
        {
          "type": "paragraph",
          "text": "Some time later, Drogon, Rhaegal and Viserion fly over the assembled Dothraki, Ironborn, Dornishmen, Reachmen, and Unsullied fleet of House Targaryen. Daenerys, clad in Targaryen black, stands on the deck of the flagship with Tyrion, Missandei, and Varys, looking ahead to the next round of the game of thrones, which she intends to win with fire and blood."
        }
      ],
      "images": [
        {
          "src": "http://vignette3.wikia.nocookie.net/gameofthrones/images/7/7d/Daenerys_Targaryen_Sails_to_Westeros%2C_Season_6_Episode_10_Preview..jpg/revision/latest/scale-to-width-down/180?cb=20160628050607",
          "caption": "Dany and her fleet head to Westeros."
        }
      ]
    },
    {
      "title": "Appearances",
      "level": 2,
      "content": [],
      "images": []
    },
    {
      "title": "First",
      "level": 3,
      "content": [
        {
          "type": "list",
          "elements": [
            {
              "text": "Citadel maester (The Winds of Winter)",
              "elements": []
            },
            {
              "text": "Lord Cley Cerwyn",
              "elements": []
            },
            {
              "text": "Lord Wyman Manderly",
              "elements": []
            }
          ]
        }
      ],
      "images": []
    },
    {
      "title": "Deaths",
      "level": 3,
      "content": [
        {
          "type": "list",
          "elements": [
            {
              "text": "Grand Maester Pycelle",
              "elements": []
            },
            {
              "text": "Ser Lancel Lannister",
              "elements": []
            },
            {
              "text": "The High Sparrow",
              "elements": []
            },
            {
              "text": "Ser Loras Tyrell",
              "elements": []
            },
            {
              "text": "Queen Margaery Tyrell",
              "elements": []
            },
            {
              "text": "Lord Mace Tyrell",
              "elements": []
            },
            {
              "text": "Ser Kevan Lannister",
              "elements": []
            },
            {
              "text": "King Tommen Baratheon",
              "elements": []
            },
            {
              "text": "Ser \"Black\" Walder Rivers",
              "elements": []
            },
            {
              "text": "\"Lame\" Lothar Frey",
              "elements": []
            },
            {
              "text": "Lord Walder Frey",
              "elements": []
            },
            {
              "text": "Lady Lyanna Stark",
              "elements": []
            }
          ]
        }
      ],
      "images": []
    },
    {
      "title": "Production",
      "level": 2,
      "content": [],
      "images": []
    },
    {
      "title": "Cast notes",
      "level": 3,
      "content": [
        {
          "type": "list",
          "elements": [
            {
              "text": "23 of 27 starring cast members appear in this episode.",
              "elements": []
            },
            {
              "text": "Starring cast members Rory McCann (Sandor Clegane), Gwendoline Christie (Brienne of Tarth), Tom Wlaschiha (Jaqen H'ghar), and Iain Glen (Jorah Mormont) are not credited and do not appear in this episode.",
              "elements": []
            },
            {
              "text": "This episode is the final appearance of starring cast members Natalie Dormer (Margaery Tyrell), Jonathan Pryce (High Sparrow), and Dean-Charles Chapman (Tommen Baratheon) due to the death of their characters. This might also be the final appearance of cast member Michiel Huisman (Daario Naharis), if his role in the story has in fact ended.",
              "elements": []
            }
          ]
        }
      ],
      "images": []
    },
    {
      "title": "Notes",
      "level": 2,
      "content": [],
      "images": []
    },
    {
      "title": "General",
      "level": 3,
      "content": [
        {
          "type": "list",
          "elements": [
            {
              "text": "The episode title is a reference to the name of the unpublished sixth novel in the A Song of Ice and Fire series, The Winds of Winter.",
              "elements": []
            },
            {
              "text": "At 69 minutes running time, this episode is the longest episode in the entire television series so far.",
              "elements": []
            },
            {
              "text": "In the Title sequence, House Stark's direwolf sigil is restored to Winterfell. The Bolton sigil replaced it from Season 4 onwards, though the direwolf sigil could be seen broken in two beside the flayed man, and in Season 3 the animation showed Winterfell burning (after it was burned at the end of Season 2 - at the end of Season 3 it was revealed that Ramsay and the Boltons burned it). Thus this is the first time that Winterfell has appeared restored, with the Stark sigil, and not a burning ruin since the Season 2 opening credits.",
              "elements": [
                {
                  "text": "The Twins returns to the title sequence for the first time since Season 3. The Wall appears in the title sequence but not in the episode itself. Oldtown appears in the episode but not in the title sequence.",
                  "elements": []
                }
              ]
            },
            {
              "text": "All storylines in the TV series have surpassed the books as of this episode. The TV series adapted certain subplots out of sync with each other, thus while Jon Snow's storyline surpassed the books starting in the Season 6 premiere, other major subplots this season such as the Greyjoy subplot and Tully/Frey subplot were holdovers from other novels. Now even these remaining subplots have caught up. The Slaver's Bay storyline surpassed the novels in the preceding episode.",
              "elements": [
                {
                  "text": "Two subplots were omitted from the TV show but won't be introduced now: when Tyrion flees east to get to Meereen it introduces a major new political shakeup happening in the Free Cities, while the Dorne subplot in Season 5 was drastically condensed, then outright abandoned at the beginning of Season 6. Because Dorne is close to the Free Cities, preview chapters for the next novel reveal that the Dorne and Free Cities subplots are going to combine with each other into one big subplot -- all of this was removed in the TV version.",
                  "elements": []
                },
                {
                  "text": "Jaime and Brienne each had about another chapter's worth of material involving running into the Brotherhood Without Banners in the Riverlands, but this subplot has also been omitted entirely thus far.",
                  "elements": []
                }
              ]
            },
            {
              "text": "With the death of Mace Tyrell, all heads of Westeros's Great Houses at the beginning of the TV series are now dead. The heads of Houses Arryn, Targaryen, Baratheon, and Stark died in Season 1, the head of House Tully in Season 3, the head of House Lannister in Season 4, and the heads of Houses Martell, Greyjoy, and Tyrell in Season 6.",
              "elements": [
                {
                  "text": "Originally there were nine (including the exiled Targaryens), then the Boltons and Freys rose to Great House status after the defeat of the Starks and Tullys - but the Starks and Tullys survived whereas by this point the Boltons are extinct, and the core Freys have been killed (the entire Frey family is still extant but has been thrown into chaos). Meanwhile the Baratheons have been driven extinct - even the fiction that Tommen was allegedly a Baratheon, now that he is dead. Thus subtracting the Baratheons from the original nine but adding back the Freys (defeated but technically alive at this point) comes back to nine.",
                  "elements": []
                },
                {
                  "text": "Of these, four out of nine are now led by women (Daenerys, Cersei, Olenna, Ellaria), two are divided between male and female leaders (whatever the situation is between Jon and Sansa, and the outright civil war between Euron and Yara), and three are technically headed by men but each of them isn't in much position to lead (the captive Edmure, Littlefinger's puppet Sweetrobin Arryn, and whatever is left of the Freys).",
                  "elements": []
                }
              ]
            }
          ]
        }
      ],
      "images": []
    },
    {
      "title": "Beyond the Wall",
      "level": 3,
      "content": [
        {
          "type": "list",
          "elements": [
            {
              "text": "This episode confirms the longstanding theory hinted at in the novels that Jon Snow is actually the secret child of Lyanna Stark and Rhaegar Targaryen - popularly known by the fandom acronym \"R+L=J\" (\"Rhaegar + Lyanna = Jon\"). It is also heavily implied, but not outright confirmed just yet, that Rhaegar didn't abduct and rape Lyanna, but instead she ran off with him, and Jon was their secret love child (although the possibility remains that her pregnancy was the product of rape). Given that Rhaegar was Daenerys's older brother, and Jon is his male heir, if Rhaegar married Lyanna in secret, then by all the different inheritance laws of Westeros Jon Snow technically ranks ahead of Daenerys Targaryen in line of succession to the Iron Throne.",
              "elements": [
                {
                  "text": "Complicating matters is if Jon was not only a Stark bastard, but a Targaryen bastard or not. Daenerys would still rank ahead of Jon if he was merely Rhaegar's bastard son, and Rhaegar was already married to Elia Martell. On the other hand, the Targaryens were known to practice polygamy in past centuries when they thought they could get away with it - always a contentious issue with the Faith of the Seven which forced them to abandon it. Nonetheless it is possible that Rhaegar entered into a second marriage to Lyanna in secret, making Jon his legitimate son. Of course, as Renly Baratheon pointed out in Season 1, the \"line of succession\" is often just a legal fiction decided at the point of a sword: Robert Baratheon claimed the Iron Throne on the token pretext that he was Rhaegar's second cousin (his grandmother was a Targaryen), but it was ultimately decided on the battlefield.",
                  "elements": []
                }
              ]
            },
            {
              "text": "As implied in their brief dialogue, Lyanna Stark feared that Robert Baratheon would kill her baby if he found out that Jon was actually Rhaegar Targaryen's son, and she made Ned promise to protect him. As a result, when Ned Stark returned north to Winterfell from the war, he passed off Jon as his own bastard son, when he was in fact his nephew. The only thing he'd ever say about Jon's mother was a vaguely concocted explanation that he fathered her on a servant girl named \"Wylla\". Ned came very close to telling Jon the truth about his mother when they last saw each other at the beginning of Season 1, but ended by emphatically saying that \"you might not have my name, but you have my blood\".",
              "elements": [
                {
                  "text": "It was mentioned multiple times in both the books and TV series that it would have been out of character for Ned Stark to father Jon on some camp-follower - Robert Baratheon enjoyed whores, but Ned was very restrained and honorable and didn't, particularly because he had just married Catelyn Tully and felt their vows were binding. In Season 5, Stannis Baratheon remarked to his wife that he doubted Jon was just some random whore's son because he knew Eddard for years and that really wasn't his way.",
                  "elements": []
                },
                {
                  "text": "Recall the scene in Season 1 episode 2 \"The Kingsroad\", closely following the books, when King Robert absent-mindedly asked Ned what the name of his bastard son's mother was, and he got a hesitant look on his face and said \"Wylla\". Even Robert joked that she must have been quite a woman to make Ned break his marriage vows - not the most observant of characters, it didn't occur to Robert that Ned's story was therefore outright implausible.",
                  "elements": []
                },
                {
                  "text": "In the first novel alone, several different rumors are given about who Jon's mother is, and Ned himself even gives somewhat conflicting accounts about it, hinting early on that he was lying about it. Some said he was the product of an affair Ned had not just with some random servant, but with Lady Ashara Dayne - sister of Arthur Dayne, the Sword of the Morning, others that the mother had been Wylla, a maid in service to Ashara, along with other rumors. It's possible that Wylla was the name of one of the midwives who attended Lyanna in childbirth.",
                  "elements": []
                },
                {
                  "text": "Lyanna actually told Ned what to name her baby, but the audio is hidden from the audience as she whispers it to him. It's possible that \"Jon\" isn't even the actual first name she intended for him. The novels heavily imply that Ned Stark named him \"Jon\" after his great friend and mentor Jon Arryn, a man who was like a second father to him but was nothing to Lyanna. It's possible that Ned choose this name because the name chosen by Lyanna was too Targaryen for the child's sake and that he intended to reveal to Jon his full and true name when he reached adulthood.",
                  "elements": []
                },
                {
                  "text": "In the books, no one doubts that Jon is related to Ned because he looks just like Ned in his youth: Jon inherited the very strong Stark physical features of dark hair and a long face. Indeed, Ned's other children with Catelyn Tully mostly took after her Tully features of auburn hair and blue eyes. In Catelyn's first POV chapter at the beginning of the first book, she even pointed out how painful it was that Jon Snow actually looks more like his \"father\" Ned than her own son Robb Stark. Arya was the only one of their children to inherit dark Stark features, and Ned said she looked like her aunt Lyanna when she was young - which could have been a hint that just as Arya took after her aunt in appearance, Jon took after his uncle, not his real father, in appearance. The TV show apparently also made some effort to match this: TV-Robb had somewhat brown/auburn hair like Catelyn, while TV-Jon also closely resembles Ned.",
                  "elements": []
                }
              ]
            },
            {
              "text": "The TV series teased the audience about the theory on Jon's Targaryen parentage earlier, back in Season 5 when Sam was reading Maester Aemon a letter describing how his great-niece Daenerys was surrounded by enemies in Slaver's Bay: for all Aemon knew, Daenerys was his last living relative, and he remarked to Sam that it was a terrible thing for a Targaryen to be alone in the world - then at that instant, as if on cue, Jon walked into the room. Aemon wasn't actually alone without other Targaryens around.",
              "elements": []
            },
            {
              "text": "Given that Jon Snow is actually the son of Lyanna Stark, this means that his alleged siblings Sansa, Arya, and Bran are actually his first cousins. Jon's future political career as King in the North may hinge on marriage-alliances: first cousins marriages are not considered Incest in Westeros and are actually fairly common among the nobility. Tywin Lannister married his own first-cousin Joanna Lannister. Indeed, in the novels, even the Starks have had first cousin marriages in recent times: Ned Stark's own parents Rickard Stark and Lyarra Stark were first cousins once removed (her name was already \"Lyarra Stark\" before they married). Thus it is not implausible that if this revelation came to light, Jon could legally marry Sansa or Arya to cement his claim over the North.",
              "elements": [
                {
                  "text": "Another potential marriage-alliance for political goals by Jon Snow may of course be with Daenerys Targaryen herself. Due to Jon Snow actually being the son of Daenerys's eldest brother Rhaegar Targaryen, Daenerys is actually Jon's aunt. Nonetheless, the Targaryens were known to practice uncle-niece or aunt-nephew marriages in the past (which aren't quite as incestuous as brother-sister marriages). Rhaenyra Targaryen married her own uncle, Daemon Targaryen. Thus according to Targaryen customs it would also be perfectly legal for Jon Snow to marry his aunt Daenerys Targaryen to secure a political alliance.",
                  "elements": []
                },
                {
                  "text": "Given that the legality of Jon's birth hinges on if his father Rhaegar Targaryen entered into a polygamous marriage, it isn't even outside the realm of possibility that Jon might invoke Targaryen custom to marry both Sansa, Arya or/and Daenerys.",
                  "elements": []
                }
              ]
            },
            {
              "text": "Correspondingly, Jon Snow being the son of Lyanna Stark actually means that Bran Stark is ahead of both Sansa and Jon in line of succession, regardless of whether Jon is a bastard or later legitimized by decree. Ned Stark was Lyanna's older brother, meaning that all of Ned's children rank ahead of Lyanna's son Jon according to the succession laws of Westeros. Thus while a rift seems to be developing between Jon and Sansa about which of them should rule the North - Sansa the trueborn daughter or Jon the male bastard - Bran's revelation of Jon's parentage when he returns south may render this contention moot. Sansa wouldn't resent Bran ruling ahead of her, because he was always ahead of her in line of succession as a trueborn son. Technically even Rickon ranked ahead of Sansa, due to their male-preference primogeniture system of inheritance.",
              "elements": []
            },
            {
              "text": "The name of the novel series on which the TV show is based is A Song of Ice and Fire: as the son of Lyanna and Rhaegar, Jon Snow is both in one person. The Starks rule over the North, and are often associated with ice and snow, particularly because their kingdom is bordered by the Wall. The Targaryens, meanwhile, are associated with fire due to their dragons - their ancestral castle on Dragonstone is even located next to a volcano.",
              "elements": []
            },
            {
              "text": "This revelation now clearly raises the possibility that Jon Snow is The Prince That Was Promised, the messiah who will save the world from the return of the White Walkers. In the books, the prophecy about the Prince That Was Promised more clearly states that the Prince will be someone of the Targaryen bloodline.",
              "elements": [
                {
                  "text": "Stannis Baratheon met the requirement for this because his grandmother was a Targaryen, as noted by his followers in the books.",
                  "elements": []
                },
                {
                  "text": "The fact that Daenerys is female does not rule her out as a candidate, however: in the novels Maester Aemon analyzes the prophecy and concludes that his great-niece Daenerys is \"the Prince That Was Promised\", explaining that in High Valyrian the word for \"Prince\" is gender-neutral (like \"ruler\", it can refer to a man or woman).",
                  "elements": []
                },
                {
                  "text": "Another major part of the prophecy also states that \"the dragon has three heads\": that \"the Prince That Was Promised\" isn't actually one person but three people acting together. Even when Aegon I Targaryen conquered and united the Seven Kingdoms with dragons, he didn't actually do it alone, but united with his two sister-wives - which is why the official heraldry that he designed for House Targaryen from that day forward is of a red three-headed dragon. The prophecy is in their very own sigil.",
                  "elements": []
                },
                {
                  "text": "Finally, the camera lingers on the hilt of the sword Dawn sitting above Lyanna's bloody sheets. The sword's pommel has a star on it, fitting the line \"born under a bloody star.\"",
                  "elements": []
                }
              ]
            },
            {
              "text": "The mothers of both Jon Snow and his aunt Daenerys Targaryen died in childbirth, and soon afterwards they had to be secreted away from their father's enemies who wanted to kill them.",
              "elements": []
            },
            {
              "text": "It remains unclear if Benjen Stark actually is the character \"Coldhands\" from the novels, or a similar revenant, or if the TV series is condensing the two characters together. Coldhands in the novels similarly appears to be a dead human who was being turned into an undead wight, but the Children of the Forest intervened, so that he retains his consciousness and free will. Whatever the case, Coldhands in the novels gives the same explanation that Benjen does: the Children worked strong spells into the foundations of The Wall when it was constructed which prevent dead things animated by magic, such as himself, from passing through it.",
              "elements": [
                {
                  "text": "Even in the novels, the corpses of Othor and Jafer Flowers reanimated as wights inside Castle Black - but they had to be brought through the Wall by the Night's Watch when they found their bodies. It's possible that even if Coldhands and/or Benjen were brought through the Wall by someone else, they might only reanimate as a mindless wight, which is why they avoid it",
                  "elements": []
                }
              ]
            }
          ]
        }
      ],
      "images": []
    },
    {
      "title": "In King's Landing",
      "level": 3,
      "content": [
        {
          "type": "list",
          "elements": [
            {
              "text": "Cersei Lannister's storyline has surpassed the novels, but it is indeed possible that she will kill the High Sparrow and the Tyrells in this manner. She won't kill her uncle Kevan this way, because in the books he was killed along with Pycelle - and by Varys instead of Cersei.",
              "elements": [
                {
                  "text": "In the books, Tyrion actually gathered up all of the old wildfire caches around the city to use in the Battle of the Blackwater, but Cersei did commission the Alchemist's Guild to keep producing increasingly large quantities, which she later used to burn the Tower of the Hand to the ground, becoming almost erotically excited at the sight of it burning - hinting at developments in future books. Thus in the books, the wildfire caches were removed but Cersei would probably replace them, while in the TV version, they simplified the plot mechanics to just have the original wildfire caches always there.",
                  "elements": []
                }
              ]
            },
            {
              "text": "There was a large amount of foreshadowing in the TV series that Cersei would destroy the Great Sept with wildfire:",
              "elements": [
                {
                  "text": "When Olenna left King's Landing, she pointed out that Cersei had lost all of her allies, had nothing left to offer anyone, and ended by bluntly asking if Cersei was just going to try to kill everyone as her only remaining option. As it turned out, Cersei did just resort to assassinating all of her enemies in the city - ignoring the long-term political backlash this will cause.",
                  "elements": []
                },
                {
                  "text": "Jaime remarked to Edmure that Cersei loves her children so much that she would burn cities to ashes to keep them safe. Jaime was being figurative and didn't know what Cersei was planning to actually detonate a massive explosion in King's Landing to destroy the Great Sept.",
                  "elements": []
                },
                {
                  "text": "In the preceding episode, Tyrion rather prominently reminded the audience about the wildfire cashes stored throughout the city when he revealed their existence to Daenerys, pointing out how ruthless and evil her father was.",
                  "elements": []
                }
              ]
            },
            {
              "text": "Margaery Tyrell's death is a major spoiler for the next novel. There was no hint or indication that she would die. There is no explicit confirmation that this will occur in the next book, though it seems unlikely that the TV show would kill off such a major character if she didn't also die in the books.",
              "elements": []
            },
            {
              "text": "Cersei probably won't kill Loras Tyrell in this manner, though he does indeed receive mortal burn wounds in the latest novel. In the fourth book, Euron Greyjoy begins attacking the west coasts and is threatening Highgarden itself, so the Lannister-Tyrell alliance needs to move its fleet west to intercept them. The problem is that their fleets are still tied up besieging Stannis's remaining garrison at Dragonstone island. Realizing he needs to force a quick end to the siege at Dragonstone to save his homeland, Loras boldly volunteers to Cersei that he will lead the assault. Cersei is only too happy to agree, knowing full well that it will be a bloodbath and she hopes he gets killed. Loras's performance in the ensuing battle at Dragonstone leaves many in awe, as he fought like the Warrior himself. Towards the end, however, Loras became badly wounded and trapped under an archway from which the enemy poured boiling oil on him. Loras was horrifically burned over most of his body and not expected to live. On the other hand, by the end of the fifth novel, Loras has stubbornly managed to cling to life - barely - against all odds and all predictions of the maesters, so it is not clear if he will pull through. Ultimately, however, in both the books and TV series, Loras ends up being horrifically burned.",
              "elements": []
            },
            {
              "text": "It is unclear who the heirs to House Tyrell actually are in the TV continuity at this point. Olenna Tyrell only vaguely mentions that with the deaths of her son Mace and her grandchildren Margaery and Loras, Cersei took away her \"future\". In the novels, they actually have two older brothers, Willas and Garlan, who were omitted from the TV continuity, as Loras was repeatedly said to be the current heir to his father. Moreover, as a large and powerful Great House, in the books they have numerous cousins and second cousins who hold various positions within their reign over the Reach.",
              "elements": [
                {
                  "text": "The TV continuity technically did acknowledge that other minor Tyrell cousins exist, and they are direct descendants of Olenna. Back in Season 3 episode 4 \"And Now His Watch is Ended\", an unnamed Tyrell handmaiden - credited only as \"Tyrell lady\" - actually had a speaking line in which she showed her embroidery to Olenna and asked, \"Do you like it, Nana?\" - i.e. directly stating that Olenna is her grandmother. In the books many of the minor Tyrell cousins serve as handmaidens to the main members of the family, thus it was always somewhat implied that the background handmaidens that appear in the TV show are actually Tyrell cousins. This \"Tyrell lady\" was never formally named, but the eldest of Margaery's cousins who serve in her retinue as handmaidens is Elinor Tyrell.",
                  "elements": []
                },
                {
                  "text": "Of course, given that Mace Tyrell was in the Great Sept with his entire retinue along with Margaery to observe Loras's trial, it is not impossible that all of Margaery's handmaidens, including her cousins, were present in the Great Sept and killed in the explosion.",
                  "elements": []
                },
                {
                  "text": "Ultimately, Season 7 will have to address who the new heir to House Tyrell will be.",
                  "elements": []
                }
              ]
            },
            {
              "text": "It is unclear who the heirs to House Lannister are now, after Tywin's three children Cersei, Jaime, and Tyrion, and with all three of Cersei's children dead. Even Jaime pointed out in Season 4 that if he didn't inherit as a Kingsguard, and Cersei's children were Baratheons, Tyrion was Tywin's only realistic heir, unless he wanted the title to pass to some minor cousin he'd never even heard of.",
              "elements": [
                {
                  "text": "Kevan Lannister and his son Lancel die in this episode. Kevan's two younger sons Willem and Martyn Lannister previously died in Season 3. Martyn actually lived in the books but the TV version condensed him with another Lannister cousin. In the books, Kevan also has an infant daughter named Janei.",
                  "elements": []
                },
                {
                  "text": "Tywin had other siblings and cousins in the books, who had their own children who could potentially inherit rule after Tywin's three children - that other minor cousins exist has been sporadically mentioned before in the TV series but the specific ones from the novels haven't been introduced by name into the TV continuity.",
                  "elements": []
                }
              ]
            },
            {
              "text": "Tommen Baratheon's death in this episode renders \"House Baratheon of King's Landing\" extinct - the cadet branch of House Baratheon that was going to hold the Iron Throne as the new dynasty founded by Robert Baratheon. Of course, after Robert's death, the royal House was \"Baratheon\" in name only, as all of Cersei's children were actually Jaime's bastard children.",
              "elements": [
                {
                  "text": "For that matter, \"House Baratheon\" as a whole is now officially extinct. At the start of Season 2 it split into three factions led by Joffrey, Stannis, and Renly, but even after the deaths of Robert's brothers, the Lannisters at least maintained the pretense that Tommen actually was Robert's own son. Now no one can even claim that any trueborn Baratheons are still alive. The only known surviving member of the Baratheon bloodline is Robert's bastard son Gendry - this may be relevant in the future but for now he hasn't been acknowledged or laid claim to the title (the way that Jon Snow claimed rule of House Stark due to lack of legitimate male heirs).",
                  "elements": [
                    {
                      "text": "In the books, at least two of Robert's other bastard children survived: Mya Stone in the Vale and Edric Storm, who was taken in by Stannis then sent to the Free Cities. Parts of Edric's storyline were merged with Gendry's, but otherwise Edric and Mya apparently don't exist in the TV continuity, and Gendry is being treated as Robert's only surviving bastard.",
                      "elements": []
                    }
                  ]
                }
              ]
            },
            {
              "text": "Actor Dean-Charles Chapman now holds the distinction of filming two death scenes in the TV series, for two separate characters: he first appeared in Season 3 playing Martyn Lannister, but was then called back in Season 4 to be recast as Tommen Baratheon - given that Tommen is Martyn's first cousin once removed, it does make sense that they would resemble each other. In Season 3 Chapman filmed Martyn's death scene when the Karstarks killed him in his prison cell, and now in this episode he filmed Tommen's death scene committing suicide by jumping out a tower window. The only other people on the TV show who have filmed multiple death scenes are stuntmen (i.e. Ian Whyte played two different giants who died).",
              "elements": []
            },
            {
              "text": "The death of the High Sparrow might mean that Cersei will try to reinstate Jaime to the Kingsguard. Seven members including Gregor appear on-screen during her coronation, however - though at this point it doesn't seem that Cersei would feel limited by the tradition that there are supposed to be only seven Kingsguard members at a time.",
              "elements": []
            },
            {
              "text": "As Cersei was responsible for both Kevan and Lancel's deaths, this makes her a kinslayer. She is the third of Tywin's children to be a kinslayer: Tyrion killed their father Tywin with a crossbow, and before that Jaime killed their distant cousin Alton Lannister as part of an escape attempt (though he felt bad about it). In the books, Jaime never killed any of his cousins: Alton was the TV version of Cleos Frey, but stated to be a very distant cousin, which isn't considered as bad as killing your own uncle and first cousin like Cersei just did. Cersei didn't kill Kevan in the novels, Varys did, though it now seems probable that she is going to blow up the Great Sept using wildfire, in which case she is probably going to kill Lancel along with the rest of the Faith Militant, still making her a kinslayer.",
              "elements": []
            },
            {
              "text": "Cersei has now totally purged what little was left of the Small Council. Her uncle Kevan Lannister was Hand of the King, while Mace Tyrell was simultaneously Master of Ships and Master of Coin. Even Grand Maester Pycelle is dead, the last original member of the Small Council from Season 1 (and who, in fact, had been on the council longer than anyone, since before the reign of the Mad King). The only surviving members are Qyburn (who was Master of Whisperers) and Jaime himself - as pointed out earlier this season, the Lord Commander of the Kingsguard is one of the seven permanent members of the council, but it is unclear if Cersei will have him reinstated. Cersei named Qyburn as her new Hand of the Queen - notice that he is wearing the traditional hand-sigil pin of the office during Cersei's coronation. It's possible that she might not even bother to rebuild the Small Council after this, preferring to rely on her own (extremely limited and unreliable) judgement and just keeping Qyburn as her direct advisor.",
              "elements": [
                {
                  "text": "Meanwhile, Daenerys Targaryen is steadily building up her own Small Council, with capable advisors and administrators. She just named Cersei's brother Tyrion as her Hand of the Queen, and it seems probable that Varys will be her Master of Whisperers and Yara Greyjoy her Master of Ships.",
                  "elements": []
                }
              ]
            },
            {
              "text": "The reanimated Gregor Clegane takes off his helmet for the first time in this episode - his face is still obscured by shadow, but seems very corpse-like. In the novels, after his reanimation he wears an all-concealing helmet visor - in the TV version his eyes are visible, possibly due to the practical needs of the actor to move around. In the books, however, it isn't even clear if Gregor has a head anymore, but is some sort of Frankenstein's monster. There are some lines in one of Bran's visions which somewhat imply that he doesn't have a head anymore, coupled with the fact that the Lannisters later claimed that he died and delivered what they said was Gregor's skull to Dorne as proof of his death.",
              "elements": []
            },
            {
              "text": "Cersei in this TV episode, particularly the scene in which she taunts Septa Unella, behaves much more like Cersei from the novels than before, flippantly remarking on the joy she takes in crushing her enemies. A difficulty is that much of this was conveyed in Cersei's POV chapters in the novels - things from her inner mental narration that she wouldn't actually dare say aloud, limiting the TV show's ability to communicate it. Now Cersei isn't bothering to put up an act anymore, and openly admitting how she actually feels.",
              "elements": []
            },
            {
              "text": "Lena Headey vaguely mentioned in a subsequent interview with Entertainment Weekly that the scene in which Cersei toys with Septa Unella then leaves her to be tortured was originally going to be much more graphic: \"Its so depraved, its brilliant. The scene was meant to be worse, but they couldnt do it. This is like the tame version. Its pretty bad still though.\"",
              "elements": []
            },
            {
              "text": "Tommen's death fulfills the prophecy that Cersei received from Maggy in her youth, that all three of her children would predecease her: they would have golden crowns (hair) but also golden (burial) shrouds - and indeed Tommen's burial shroud in this episode is gold colored. Of course, this may have been a self-fulfilling prophecy, given that the deaths of all three of Cersei's children were directly or indirectly due to her own actions.",
              "elements": [
                {
                  "text": "The prophecy also said that Cersei would be replaced by a younger and more beautiful queen, which she took to mean Margaery Tyrell. Cersei probably thought that killing Margaery at the Great Sept would invalidate the rest of the prophecy. Instead, Tommen ended up dying anyway (due to her own actions) and the prophecy may in fact have referred to Daenerys Targaryen.",
                  "elements": []
                }
              ]
            },
            {
              "text": "As pointed out in the \"Inside the Episode\" featurette, Tommen might not have died if Cersei had bothered to consider that he might be upset at his wife's death, and come to console him or try to explain what happened. He's also upset that his mother just murdered hundreds of people, many of them innocent bystanders, and no one will ever think he is a good king after this. Instead, Cersei prioritized watching the explosion and gloating while sipping a cup of wine, and then tormenting Septa Unella in the dungeons. Thus Tommen's death is directly her fault, and she could have easily prevented it if she actually gave more thought to him. This is sort of a point from the books: Cersei thinks she loved all of her children, but she really fixated on Joffrey while ignoring Tommen and Myrcella as anything more than extensions of herself.",
              "elements": []
            },
            {
              "text": "Cersei crowning herself as the new Ruling Queen on the Iron Throne is farcical in-universe, comparable to two men on a sinking ship fighting over who gets to be the captain. With all of her children dead she has absolutely no claim to the throne whatsoever, not even the token explanation she was using before that she was ruling on behalf of her children by King Robert (all of whom actually weren't Robert's children). Cersei simply seized control of the capital city with whatever is left of the Lannister armies, because they happened to be in King's Landing at the moment. It's doubtful she can hold the city against her enemies with what few forces she has left.",
              "elements": []
            },
            {
              "text": "Cersei isn't even functionally the queen over more than one or two of the \"Seven Kingdoms\" anymore: The North has just successfully risen in revolt again, the Vale has openly declared for the Starks, and Frey control over the Riverlands has been shattered thanks to Arya; the Iron Islands remain independent and weren't even controlled by her son Joffrey, and now both the Reach and Dorne are openly declaring for Daenerys Targaryen. Essentially, the only parts of Westeros that Cersei actually controls anymore are King's Landing and the Crownlands, the Westerlands, and maybe a bit of the Riverlands between to connect the two - supplemented by the Stormlands, which surrendered after the Battle of the Blackwater and has no military strength left at all.",
              "elements": [
                {
                  "text": "In effect, with the destruction of the Lannister-Tyrell alliance and resurgence of the North, the Lannisters' zone of control has shrunk back to more or less what it was right after Joffrey first took power, so they're no better off than they were originally (in early Season 2). In fact, they're actually far worse off than they were when the war began: Cersei has zero actual right to rule, half of the Lannister armies were destroyed by Robb Stark, and the Lannisters are financially bankrupt from heavy wartime spending. Winter has finally begun, but they don't have access to either of the two main breadbasket regions of Westeros anymore: the Riverlands are a burned out husk, and the Reach has outright turned against them. Olenna even tried to warn Cersei in Season 5 how ridiculous it was to turn against the Tyrells, given that the Lannisters are directly reliant upon them for money and even shipments of basic food supplies. Cersei apparently didn't realize or simply didn't care that killing the ruler of House Tyrell and his two children would turn the Reach to open war against her.",
                  "elements": []
                },
                {
                  "text": "Given that the few remaining territories the Lannisters still control are in the middle of Westeros, Cersei is now facing major enemies in all four directions: Jon, Sansa, Littlefinger, and their armies to the North; Euron Greyjoy's fleets and armies to the west; the Tyrells and Dorne to the south; and Daenerys's army and dragons arriving in a fleet from the east.",
                  "elements": []
                }
              ]
            },
            {
              "text": "During Cersei's coronation, the title for the ruler who sits on the Iron Throne has once again flip-flopped between \"King of the Andals and the First Men\" and \"King of the Andals, the Rhoynar, and the First Men,\" with no semblance of internal consistency.",
              "elements": [
                {
                  "text": "The full title refers to the Rhoynar ancestors of the Dornishmen, but because back in Season 1 the showrunners didn't know if the TV series would ever introduce Dornish characters, they removed virtually all references to the Rhoynar and the Dornish so as not to confuse the audience. The result was that the shortened title \"King of the Andals and the First Men\" has been used since the beginning of the very first episode, when Ned Stark executed a Night's Watch deserter.",
                  "elements": []
                },
                {
                  "text": "This shortened title was consistently used through Season 4, even when Oberyn Martell was physically present at Tommen's coronation as \"King of the Andals and the First Men\". There was one isolated incident earlier in Season 4 when Missandei introduced Daenerys using the full title \"Queen of the Andals, the Rhoynar, and the First Men\" - but in the Season 4 finale, Missandei introduced Daenerys using the shortened title, omitting \"the Rhoynar\".",
                  "elements": []
                },
                {
                  "text": "Through Season 5, the TV show continued to consistently use the shortened title \"King of the Andals and the First Men\", to the point that Game of Thrones Wiki considered the single appearance of \"the Rhoynar\" in Season 4 to simply be a non-canon script error.",
                  "elements": []
                },
                {
                  "text": "In the Season 6 premiere, however, Daenerys once again introduced herself as \"Queen of the Andals, the Rhoynar, and the First Men\". At this point it wasn't even clear what the title is supposed to be in the TV continuity - in contrast with if the writers officially chose to make a formal retcon that the title would subsequently include \"the Rhoynar\" and stuck with it consistently.",
                  "elements": []
                },
                {
                  "text": "Now at the end of Season 6, the TV show once yet switches back to using the shortened version, with no internal consistency, when Qyburn crowns Cersei as \"Queen of the Andals and the First Men\", omitting \"the Rhoynar.\"",
                  "elements": []
                }
              ]
            },
            {
              "text": "Marei the prostitute reappears in this episode, in Pycelle's chamber, making her the longest recurring prostitute character in the TV series. She first appeared in the Season 2 premiere, and with this episode has appeared in five continuous TV seasons (even Ros only appeared for three TV seasons, and Shae for four seasons).",
              "elements": []
            }
          ]
        }
      ],
      "images": []
    },
    {
      "title": "In the North",
      "level": 3,
      "content": [
        {
          "type": "list",
          "elements": [
            {
              "text": "As Sansa Stark explains, they just received a white messenger-raven at Winterfell sent from The Citadel by the Order of Maesters - signifying that winter has finally begun. White messenger-ravens are a special sub-breed kept at the Citadel which are larger, stronger, and smarter than normal ravens: they are only sent out to carry the important official announcement across Westeros that the seasons have changed. The Citadel gathers reports about weather from maesters all over Westeros, and after much deliberation determines when one season can be considered to have officially ended and the next begun. A white raven previously appeared in the Season 2 premiere, \"The North Remembers\", when it was delivered to the Small Council to inform them that the ten year long summer had officially ended and turned to autumn (though the episode didn't explain in dialogue why the raven was white, this is a detail from the books). For six seasons, the TV series has been promising the Stark words that \"Winter is Coming\". The white ravens in this episode officially announce, as Sansa states, that \"winter is here\".",
              "elements": [
                {
                  "text": "Jon jokingly points out that their father always said it would come, i.e. with the Stark House words. This highlights another point: the summer that ended at the beginning of Season 2 lasted for ten years, unusually long, and there was a spring season before that. Jon was around 16 years old in Season 1 of the TV series, and Sansa stated to be 13 years old. Therefore, none of the Stark children were old enough to really remember experiencing the previous winter (granted, there are occasional \"summer snows\" in the North during cold spells, mentioned in the TV show, but nothing comparable to a full-on winter).",
                  "elements": []
                },
                {
                  "text": "In fact, the white ravens can be seen being released into the air in Samwell's subplot when he arrives at the Citadel itself in Oldtown. Sam frowns when he sees them, knowing what they indicate.",
                  "elements": []
                },
                {
                  "text": "In the books, the white ravens announcing the arrival of winter are sent out soon after Cersei's Walk of atonement. The TV series adapted several storylines out of synch with each other, thus the white ravens only arrive at the time of her trial.",
                  "elements": []
                },
                {
                  "text": "Cersei previously mentioned to Littlefinger in Season 5 that they could tell autumn would be ending relatively soon, noting that the weather had started to turn. The length of the years-long seasons in Westeros can be unpredictable, but they can get a general sense when a season is drawing to a close, i.e. cold weather in early November/early December still technically isn't \"winter\", but people can observe the gradual shift.",
                  "elements": []
                }
              ]
            },
            {
              "text": "This episode gives some clarification for Sansa Stark's actions not telling Jon Snow that the large army of the knights of the Vale was riding north - in which case he shouldn't have rushed ahead to attack Ramsay Bolton's army with a smaller force. In this episode, Sansa simply apologizes to Jon for this: apparently indicating that she didn't tell Jon simply because she didn't know if the Vale army was even coming - that she never received any letters back from them - thus she had no idea if they would arrive in time or even if they were coming at all. Thus it appears that she didn't tell Jon simply because she didn't want to get his hopes up in case the Vale knights didn't come. Moreover, if Sansa told Jon the full truth, that she rejected Littlefinger's earlier offer out of anger, and then if he didn't come when she later begged him for aid, Jon might think it was her fault for not just accepting Littlefinger's original offer, but instead alienating a badly needed ally.",
              "elements": []
            },
            {
              "text": "As clarified in the \"Inside the Episode\" featurette, there is some growing tension between Jon and Sansa about who will rule the North: Sansa is a trueborn daughter and thus by rights should rank ahead of a bastard son like Jon. Moreover, Jon makes it clear that he doesn't even want to rule the North and expects Sansa to be Lady of Winterfell. Unfortunately, their assembled bannermen then spontaneously declare Jon their new king because they were impressed by his bravery on the battlefield personally fighting the Boltons; thus through no intention of his own, Jon ends up usurping Sansa's right to rule the North. In an ironic twist, it was Lyanna Mormont, a female ruler, who first declared Jon to be King in the North, as well as rally the other lords to declare Jon King in the North. The rift between Jon and Sansa is very subtly shown in the scene where Jon is declared king. When Lyanna Mormont states that she knows \"No king but the King in the North, whose name is Stark', Sansa is smiling. This could be because she believes Lyanna is about to declare her, Eddard Stark's trueborn daughter, Queen in the North. However, when Lyanna then says \"I don't care if he's a bastard.\" the smile quickly fades from Sansa's face, as she realizes that Lyanna is referring to Jon, not her. She smiles again afterward because she is happy for her brother, but the smile fades once more when she sees Littlefinger, who is smirking knowingly due to their earlier meeting where he brought up that Sansa should be the North's future, not Jon.",
              "elements": [
                {
                  "text": "According to Sophie Turner, Sansa does not actually care to be Queen in the North, and is more upset that she receives no credit or even acknowledgement for her large part in making Jon become King in the North. This makes her worried that, now that he has this power, Jon will return to not listening to her or trusting her to be a capable ally to him. Kit Harrington agrees, saying that Jon has not learned his lesson yet, wanting Sansa to trust him but not returning the favor by publicly acknowledging her and making her see he is worth trusting. Littlefinger will most likely play this angle to his advantage in Season 7.[CITATION?]",
                  "elements": []
                }
              ]
            },
            {
              "text": "Jon Snow is declared the new King in the North in this episode, officially reviving the independent Kingdom of the North that was crushed with Robb Stark's death at the Red Wedding. Littlefinger says that the large army of the Vale has declared for the Starks as well. The Vale Lords also declare Jon Snow King in the North. Also, thanks to Arya's actions in destroying the Freys' leadership, their already tenuous hold over Robb Stark's former bannermen in the Riverlands will fall apart, possibly allowing them to rejoin the Starks as well.",
              "elements": [
                {
                  "text": "In the \"Inside the Episode\" featurette, the showrunners acknowledge that the scene hailing Jon as the new King in the North is meant to imitate the first one with Robb Stark at the end of Season 1 - and that this is supposed to give a hint of uneasiness, given that Robb Stark ended up dying after being declared king, and the declaration is driving a wedge between Jon and Sansa.",
                  "elements": []
                },
                {
                  "text": "A concern is that unlike in the books, Jon knows that Bran didn't die during the fall of Winterfell; Season 4 changed this so that Samwell broke his word to Bran and told Jon that he saw his brother and that he was heading beyond the Wall. As a trueborn Stark son, Bran unquestionably ranks ahead of both Jon and Sansa in line of succession. Jon makes no attempt to bring this up - though on the other hand, Jon has heard no news of Bran still being alive for maybe a year or two by this point, so it's possible he assumes he might never see him alive again (particularly because in the TV show he saw no sign of him at Craster's Keep).",
                  "elements": []
                },
                {
                  "text": "Lord Wyman Manderly of White Harbor appears for the first time in this episode. As Lyanna says, his son Wendel Manderly was killed at the Red Wedding - indeed he was shown on-screen being killed with a crossbow bolt - Wendel had no speaking lines, but prominently wore a Manderly sigil pin on his tunic and his name was confirmed in the official credits for the episode. In the novels, Wyman played a much more active role planning to feign submission to the Boltons and then destroy them from within - it was Lord Wyman in the novels who made the \"Frey pies\" out of three Freys he captured, then served them back to other Freys.",
                  "elements": []
                },
                {
                  "text": "Lord Robett Glover reappears in this episode, apologizing profusely for not answering Jon Snow's call before, only because he though the battle was hopeless and didn't want to send more of his men to their deaths for nothing. When he last appeared he also mentioned that his older brother Galbart Glover hailed Robb as king (as seen in Season 1), but didn't clarify if he was dead or not. In the novels, Galbart is actually still alive - he was captured by the Lannisters after a battle, but later returned by ship in a prisoner exchange to White Harbor. Thus when other characters arrive at Deepwood Motte in the novels, Robett is indeed the acting lord. Given that even Wyman Manderly has come to the council at Winterfell from White Harbor in this episode, which apparently includes all the surviving Northern lords, this seems to confirm that Galbart simply died off-screen in battle in the TV continuity - fully making Robett the officially head of House Glover now.",
                  "elements": []
                },
                {
                  "text": "The new Lord Cerwyn, whose father was flayed alive by Ramsay Bolton, was mentioned previously in Season 5 episode 3 \"High Sparow\", when Ramsay recounted the incident to his father Roose. Lyanna Mormont even calls him out on this in this episode, stating that even though Ramsay skinned his father, Lord Cerwyn still didn't answer the call to fight. Roose even criticized Ramsay at the time because he said that while the Cerwyns were terrified of him now, this would make them hate him and turn on them if an opportunity presented itself - but there was no payoff to this.",
                  "elements": []
                },
                {
                  "text": "In the novels, Jon actually is named heir to the King in the North by Robb. Robb does this because he is childless (due to his wife, Jeyne Westerling, being given potions by her mother against pregnancy under the pretense of a fertility potion) and his younger brothers, Bran and Rickon, are believed dead. King Robb worries that Tyrion Lannister will claim Winterfell through his marriage to Sansa Stark. Thus, Robb decides to legitimize his bastard half-brother, Jon Snow, and names him as heir in his will, despite the fact that as a brother of the Night's Watch, Jon couldn't inherit any titles. However, before Jon can be informed of Robb's decision, Robb is murdered at the Twins during the Red Wedding.",
                  "elements": []
                }
              ]
            },
            {
              "text": "A curious pattern has continued again in this episode: Lord Cerwyn was gender-swapped to be a man when their leader was a woman in the novels. Several Northern rulers were already women when the war began (i.e. Maege Mormont), but so many Northern lords died in the war and at the Red Wedding that by this point in the novels, roughly one out of three major noble Houses in Westeros are actually headed by women. The prominent heads of major Northern Houses at this point are Barbrey Dustin, Eddara Tallhart, Lyessa Flint, and Jonelle Cerwyn. In the TV version, the only head of one of the Northern Houses depicted as female is Lyanna Mormont herself.",
              "elements": [
                {
                  "text": "In the books, the original lord of House Cerwyn, Lord Medger, died during the Battle of the Green Fork to the south, after which his son Cley Cerwyn inherited rule - but Cley was young and stayed behind at their home castle in the North instead of riding south with his father. When the home garrisons of the Northern Houses arrived at Winterfell to take it back from Theon Greyjoy, Ramsay Bolton betrayed them all by turning on their allies in their own camp (then betraying the ironborn who had turned Theon over to him by flaying them anyway). Thus Ramsay did kill the \"head of House Cerwyn\" in the novels through a dishonorable action, though in this case it was Cley Cerwyn himself. Thus by the beginning of the third novel rule of their House passed to Cley's sister Jonelle; she directly appears in the fifth novel when Northern lords assemble to grudgingly swear fealty to Roose Bolton as the new Warden of the North (at which time she is 32 years old).",
                  "elements": []
                },
                {
                  "text": "The TV version, wen Ramsay first mentioned the Cerwyns in \"High Sparrow\", he explained that he flayed Lord Cerwyn alive, and his wife and brother, while forcing \"his son\" to watch. Apparently this was to set up Cley Cerwyn's appearance in Season 6, but the TV series chose not to depict his sister Jonelle Cerwyn as the current head of the House: it could have easily had Ramsay said \"I flayed Lord Cerwyn and his son (not his brother) while forcing his daughter to watch\". While the TV series did omit Cley's death at Winterfell as in the books, it also never introduced or mentioned the Cerwyns at all before Season 5, so they weren't bound to Cley's \"survival\" in the TV series but were free to make up family members as they chose.",
                  "elements": []
                },
                {
                  "text": "It's possible that the TV series gender-swapped or simply omitted the other Northern leaders who are actually women in the novels because they wanted to focus on Lyanna Mormont - though this presents female leaders as exceptional, not commonplace as they are in the novels.",
                  "elements": []
                }
              ]
            },
            {
              "text": "The nickname that the Northern vassals proclaim for Jon as their king, \"the White Wolf\", seems to be in imitation of how Robb Stark was earlier nicknamed \"the Young Wolf\". Jon isn't just nicknamed this for his albino direwolf, Ghost - rather it seems to be a reference to Stark heraldry. Under the rules of heraldry in Westeros, bastard sons can't use the heraldry of their trueborn family, so they often use the same image with the color scheme reversed: i.e. the Targaryen sigil is a red dragon on a black background, so their bastard offshoot House Blackfyre used a black dragon on a red background as their sigil. House Stark's heraldry is a grey direwolf on a snow white background, thus Stark bastards in past generations have frequently used a white wolf on a grey background for their heraldry. Thus Jon would use a white wolf as a heraldic symbol of his status as a bastard of House Stark. This is one of the reasons they saw it as a sign from the Old Gods when they found a dead direwolf with exactly six pups, one for each Stark child, even in the right gender ratio - the sixth pup was even an albino, to match Jon's bastard status.",
              "elements": []
            },
            {
              "text": "When in the main great hall of Winterfell, Jon Snow reminisces that while all of the trueborn members of the Stark family sat up front on the raised dais, as a bastard he had to sit down with the commoners on the far end of the hall, because he wasn't truly part of the family. This is actually what happened in Jon's first POV chapter in the first novel, describing the feast at Winterfell for King Robert. Jon later got angry and went outside, where he ran into Tyrion Lannister. The TV version of the first episode \"Winter is Coming\" simplified this so that Jon was just already outside when Tyrion ran into him, and to explain this had Jon say that Catelyn had Jon wait outside the feast hall altogether for fear of offending Cersei by his presence.",
              "elements": []
            },
            {
              "text": "Once again the issue is raised that Melisandre refers to the leader of the White Walkers as \"the Night King\" in the presence of Davos and Jon Snow. Two episodes ago in \"No One,\" this issue was first raised when Davos (in Jon's presence) started referring to him as \"the Night King\" - even though there's no clear explanation for how any of them would know what the White Walkers' leader is called. Jon saw him at Hardhome, but the White Walkers didn't announce to Jon what their leader is called while he was there. It's possible that there is some sort of legend, not revealed to the audience, that suggests this name for the leader of the White Walkers (there are some vague hints of this in semi-canon RPGs for the books).",
              "elements": [
                {
                  "text": "Melisandre doesn't try to claim that the Night King is the Great Other, even though his very existence seems to play perfectly into the Lord of Light religion's cosmology. This might still be in character, however: Melisandre's failure with Stannis seems to have made her more reluctant to evangelize. Note that she not only hasn't tried to convert anyone this season, she has even avoided using her magic unless directly asked.",
                  "elements": []
                }
              ]
            },
            {
              "text": "Sansa says that she used to go to the Winterfell Godswood regularly to pray as a child. In the novels, it was somewhat implied that as her mother's daughter in their interfaith household, she generally focused on the Faith of the Seven that her mother followed and never seemed particularly attached to the traditions of the Old Gods. On the other hand, they had an interfaith household, and it was never explicitly made clear how much or how little of each religion different Stark children practiced.",
              "elements": []
            },
            {
              "text": "Littlefinger finally admits that what he wants is to sit on the Iron Throne as ruler of the Seven Kingdoms, with Sansa by his side. Even in the books, one of the points that scares people the most about Littlefinger is that they can't even tell what he's trying to do in the long-term - as Varys laments in both the books and TV series, only the gods know what Littlefinger could possibly be planning. Ironically, if he simply admitted that he wanted to seize the Iron Throne, this would scare people less than the fear of not even knowing what he's trying to do (i.e. to achieve revenge or acquire wealth). Littlefinger just acquires power because he likes doing it.",
              "elements": []
            },
            {
              "text": "The scene of Melisandre's exile from Jon is framed similarly to the scene where Daenerys exiled Ser Jorah after she learned about him spying on her. Both Melisandre and Jorah commit crimes that are later revealed to their leader (Jon, Daenerys). Both Jon and Daenerys ask what the accused has to say in their defense. Both confess to their crime. As a result, instead of killing Melisandre/Jorah, Jon/Daenerys has them exiled, with the threat that they'll be executed if they ever return. Also, it ends with shots of the exiled person leaving and walking into the distance, with the one who exiled standing from a high point, watching them leave.",
              "elements": []
            }
          ]
        }
      ],
      "images": []
    },
    {
      "title": "In the Riverlands",
      "level": 3,
      "content": [
        {
          "type": "list",
          "elements": [
            {
              "text": "In the books, Jaime Lannister's army doesn't advance all the way north to The Twins after the Second Siege of Riverrun, and thus he never personally met Walder Frey. After leaving Riverrun in the books, his army does advance north but only as far as Raventree Hall, the seat of House Blackwood (earlier episodes in Season 6 did mention in passing that the Blackwoods were also in revolt like the Tullys).",
              "elements": [
                {
                  "text": "Instead of advancing to Raventree Hall as in the books, in the TV version Jaime travels all the way to the Twins, then returns back south to King's Landing. Given his comments to Lord Walder, and because Raventree Hall is between Riverrun and the Twins, it's possible that they're implying the other rebelling Riverlands Houses (Blackwood and Mallister) were subdued again off-screen.",
                  "elements": []
                }
              ]
            },
            {
              "text": "When the Twins first appear in the episode and Lord Walder's voice is heard toasting \"To House Lannister!\", the Lannister soldiers gathered in the feast hall shout back \"Hear me roar!\" (it is a little indistinct, but confirmed by the subtitles). This is actually the first time that the Lannisters' official House words have appeared in a live-action TV episode. As explained in a scene between Maester Luwin and Bran back in Season 1, the Lannisters' unofficial motto - \"A Lannister always pays his debts\" - is just as popular if not more so than their official one. That the TV show hasn't used the official motto frequently before is unsurprising: even in the novels, the official motto \"Hear me roar!\" is typically only mentioned specifically just to point out that the unofficial motto is very popular too. Previously the official motto was only confirmed by one of the Histories & Lore animated featuretes from Season 1, narrated by Tywin Lannister.",
              "elements": [
                {
                  "text": "In the same scene, Lord Walder toasts House Frey, to which others respond \"We stand together!\" - suggesting that perhaps this is the motto of House Frey (which is unknown even in the current books).",
                  "elements": []
                }
              ]
            },
            {
              "text": "Jaime's disgust is palpable when Lord Walder says that they're both the same as kingslayers. This may be shifted around somewhat from a similar incident in the novels, when the Freys at the siege of Riverrun complain that Jaime scorns them when he did the same thing they did, at which he accurately points out that he never violated sacred Guest right - which is considered infinitely worse than kingslaying, an almost unthinkable act in the eyes of gods and men, and thus it isn't hypocritical that he continues to look down on the Freys and doesn't want to be compared to them.",
              "elements": []
            },
            {
              "text": "Arya Stark feeding Walder Frey his own sons to him baked in a pie is a reference to a larger subplot in the novels, the infamous \"Frey pie\" incident, which takes place in the North and doesn't involve Arya. Wyman Manderly - who actually appears in this episode - grudgingly had to feign peace with the Lannisters and their Frey allies, but was planning to betray them. A large contingent of Frey soldiers in the books accompany the Boltons into the North to help them grind down the surviving lords. Three of them are sent as envoys to White Harbor but disappear soon afterwards. Later, during the Ramsay Bolton's wedding feast at Winterfell, Wyman gleefully serves the remaining Freys a large meat pie, and to assure them that it isn't poisoned he happily eats a large portion of it himself. Wyman enjoys the pie so much that he needlessly takes a second helping, even after he already convinced the Freys it wasn't poisoned. When they ask Lord Manderly where the three missing Freys are, he says that they are actually quite close - heavily implying that they were cooked into the pie.",
              "elements": [
                {
                  "text": "Feeding Lord Walder a pie containing his own sons, in both books and TV series, may be an in-universe reference to the legend of the Rat Cook, which Bran Stark brought up in Season 3. The Rat Cook was a member of the Night's Watch who felt insulted by a visiting king, so he broke Guest right by killing the king's sons and feeding them back to him cooked into a pie. For this the gods cursed him by turning him into a rat, doomed to eat his own young. In the TV version Bran brings this up right after the Red Wedding, insisting that violation of guest right (as Walder Frey did) is the one thing above all others that the gods will punish.",
                  "elements": []
                },
                {
                  "text": "Out of universe, the \"Frey pie\" incident with Lord Manderly from the novels may be a reference to the infamous climax of Shakespeare's Titus Andronicus, in which Titus avenges himself on Tamora by killing her sons Chiron and Demetrius and feeding them back to her baked into a meat pie (\"Why there they are! Both baked in that pie!...\")",
                  "elements": []
                }
              ]
            },
            {
              "text": "In the novels, after the Freys take Riverrun several of Lord Walder's more prominent sons are given possession of the castle - but several newly hired servants who are observed in Jaime's POV narration match the physical description of members of the Brotherhood Without Banners, hinting that the Brotherhood is going to orchestrate it's own reverse-Red Wedding, to ambush and kill the Freys inside Riverrun. When she eventually returns to Westeros, Arya Stark may indeed link up with the Brotherhood again and help them take revenge on the Freys: obviously, certain scenes have been condensed and moved around, but it is unclear how large of a condensation it is that Arya will personally kill Walder Frey (for all anyone knows, she may in fact personally kill him in the next book).",
              "elements": []
            },
            {
              "text": "Arya also killed Walder's two most prominent sons in the TV series, Lame Lothar Frey and Black Walder Rivers. Lord Walder has several dozen descendants, about a dozen of whom are prominent recurring characters in the novels, but their actions were understandably condensed into just these two in the TV version. Lame Lothar is the Steward of the Twins and his father's right hand, coordinating the day to day activities of the castle; Black Walder Frey and Walder Rivers are two of their prominent army commanders (condensed in the TV version into just one character, \"Black Walder Frey\").",
              "elements": [
                {
                  "text": "In the novels, several characters express their fear that when old Lord Walder eventually dies, it will lead to a fratricidal bloodbath within House Frey, as different internal rivalries play out for who will rule. Similarly, in the TV version, House Frey continues to exist in some fashion: Lord Walder has numerous descendants and Arya didn't kill them all. Still, she has taken revenge on those most directly responsible for planning and carrying out the Red Wedding in the TV version, and decapitated House Frey's central leadership. With the loss of not only Lord Walder but also his two most trusted sons, the TV version of the Freys may dissolve into infighting as well.",
                  "elements": []
                },
                {
                  "text": "With the deaths of Lord Walder Frey, Lame Lothar Frey, and Black Walder Rivers, it is unclear who exactly is the current head of House Frey. Walder's eldest son and heir Stevron Frey was introduced with speaking lines in Season 1; Stevron later died in the second novel, however, at the Battle of Oxcross. Stevron didn't reappear after Season 1 so it was never established if he actually died \"off-screen\" in Season 2 at Oxcross as he did in the books. After Stevron's death in the novels the Frey line of succession becomes increasingly muddled as more of them die and younger wants want to usurp the older ones; the TV show has condensed this even further. No other named legitimate Frey sons or grandsons have been formally introduced on-screen.",
                  "elements": []
                }
              ]
            },
            {
              "text": "Walder Frey directly states that Arya's uncle Edmure Tully is for the moment being kept in the dungeons at The Twins - even though Jaime promised him gentle imprisonment at Casterly Rock (perhaps he meant in the long term). It's possible that next season will begin with Arya descending to the lower levels of the castle and freeing her uncle Edmure.",
              "elements": [
                {
                  "text": "Even in the books, readers have pointed out that it may be complicated to kill all members of House Frey, given that many of them are women and children who had nothing to do with the Red Wedding, and particularly, Arya's own uncle Edmure recently fathered a child with Roslin Frey (he hasn't been born yet in the books but enough time passed in the TV version that he has). Thus Arya can't truly kill every single Frey without murdering her own first cousin and making herself a kinslayer.",
                  "elements": []
                }
              ]
            },
            {
              "text": "With the death of Walder Frey, all three of the architects of the Red Wedding are now dead. Each of them died violently, but ironically, Walder Frey was the only one that the Starks directly took revenge on. Both Tywin Lannister and Roose Bolton were later killed by their own sons for unrelated reasons.",
              "elements": []
            },
            {
              "text": "Arya avenges her mother Catelyn's death by killing Walder Frey the same way that her mother died, having her throat slit, in the same room that her mother died as Walder looked on.",
              "elements": []
            },
            {
              "text": "Back in Season 2, when Arya was hiding her identity at Harrenhal by pretending to be a peasant refugee, Tywin Lannister recognized that she wasn't actually a commoner because she didn't talk with a lower-class accent. As Tywin explained, the commoners don't have good educations so they tend to make grammar mistakes and to slur words together: thus they typically say the slurred \"m'lord\" instead of clearly pronouncing two separate words \"my lord\". It is unclear of this was intentional but in this episode, when Arya is wearing her shapeshifter mask to look like a serving girl (and is played by a different actress), she clearly pronounces \"my lord\" as two separate words when she speaks, the way a highborn does - perhaps a subtle hint early on that the serving girl wasn't what she seemed.",
              "elements": []
            }
          ]
        }
      ],
      "images": []
    },
    {
      "title": "In the Reach",
      "level": 3,
      "content": [
        {
          "type": "list",
          "elements": [
            {
              "text": "This is the first time that Oldtown has appeared on-screen in the TV series. It is the second largest city in Westeros, nearly as large as King's Landing itself, but many thousands of years older and therefore much better organized. King's Landing was rapidly constructed by the Targaryens 300 years ago without much thought to organized \"city planning\" leading to slum districts like Flea Bottom, but Oldtown doesn't have these problems.",
              "elements": [
                {
                  "text": "This is also the first time that any other city in Westeros other than King's Landing itself has appeared on-screen. There are five settlements in Westeros big enough to be called cities, which in descending order of size are King's Landing, Oldtown, Lannisport, Gulltown, and White Harbor (the seat of House Manderly). King's Landing is stated to have a population of around 500,000, and Oldtown is nearly as large. Lannisport is of comparatively medium size, perhaps half as large, while Gulltown and White Harbor are much smaller (White Harbor might only have a population in the low tens of thousands).",
                  "elements": []
                }
              ]
            },
            {
              "text": "The large structure that Sam and Gilly see when they arrive at Oldtown is the aptly named Hightower, from which the city's rulers take their name: House Hightower of Oldtown. The tower is a lighthouse for ships at sea and a defensive structure. It is also the tallest structure in Westeros, even taller than the Wall (the Hightower is 800 feet tall compared to the Wall's 700 feet).",
              "elements": []
            },
            {
              "text": "This is also the first time that the Citadel has appeared on-screen, the university-like headquarters of the entire Order of Maesters which is located in Oldtown. The Citadel has been mentioned in passing since Season 1.",
              "elements": []
            },
            {
              "text": "The master reading a large book at the front desk of the Citadel when Samwell arrives there is using a set of magnifying glasses to read the small print. The technology level of Westeros and Essos actually is capable of producing magnifying glasses, and also telescopes to study the stars. Telescopes in Westeros are called \"far-eyes\" (like artificial eyes they help you see things which are far away). The best magnifying lenses are produced in the Free City of Myr, and thus are called \"Myrish lenses\". Other characters in the novels are mentioned as using magnifying glasses to help them read, such as Theon and Yara Greyjoy's maternal uncle Lord Rodrik \"the Reader\" Harlaw (who was omitted from the TV version).",
              "elements": []
            },
            {
              "text": "Notice the large astrolabes hung like chandeliers in the Citadel's vast library: they are clearly the basis for the astrolabe which appears in the Title sequence of the TV series, with filigree depicting the history of Westeros (conquest by dragons then the dragons dying, etc.). The showrunners have always said that their conception for the title sequence is that, somewhere, there is a maester who toiled away in his cell constructing a magnificent astrolabe which the camera is simply moving around during the opening credits.",
              "elements": []
            },
            {
              "text": "It's unclear how the Citadel was unaware of Jeor Mormont's death, given that in Season 5, Tyrion knew about Jeor's death, and told Jeor's son, Jorah, about it. Tyron presumably knew because the Night's Watch sent out ravens desperately requesting aid against the upcoming battle against Mace Rayder, and he was still a member of the Small Council at the time (in the brief interval between when Samwell sent the letters in the Season 3 finale and when Tyrion was arrested in episode 4.2). A possible explanation is that the Citadel simply didn't get around to reading reports from far-away Castle Black, because they think its the boring edge of the world - comparable to how even the Small Council scoffed at and ignored letters they received from the Wall in Season 2.",
              "elements": [
                {
                  "text": "Of course, Sam's information is also outdated by this point, as Jon Snow is no longer Lord Commander either. He is, in fact, the new King in the North. After Jon's death and resurrection, and then subsequent leaving to fight the Boltons, Dolorous Edd is the new de-facto Lord Commander of the Night's Watch. It is unclear when Sam will learn of what has occurred in the North since he left Castle Black.",
                  "elements": []
                }
              ]
            }
          ]
        }
      ],
      "images": []
    },
    {
      "title": "In Dorne",
      "level": 3,
      "content": [
        {
          "type": "list",
          "elements": [
            {
              "text": "This episode marks the first time that Dorne has reappeared since the Season 6 premiere, when half of the recurring Dornish characters were hastily killed off in ways that do not match the books at all (see \"Ellaria Sand's coup in Dorne\"). It appears that the showrunners abandoned the Dorne subplot when Season 6 began because they realized it wasn't working in Season 5 (it was widely condemned by critics).",
              "elements": [
                {
                  "text": "Many professional reviews criticized the lackluster dialogue given to the Sand Snakes in Season 5. In particular, Tyene Sand's line in the Season 5 finale that \"You want a good girl, but you need the bad pussy!\" was widely cited as possibly the worst line in the history of the TV series, and near-universally described as \"cringe-worthy\" or \"cringe inducing\". The showrunners may have picked up on these criticisms: ultimately Tyene Sand didn't have a single speaking line during the two episodes she appeared in Season 6. In this episode Tyene even tries to start speaking at one point but Olenna cuts her off and says she doesn't want to hear whatever she has to say - possibly a direct wink at the audience by the scriptwriters.",
                  "elements": []
                }
              ]
            },
            {
              "text": "In the books, Prince Doran Martell was actually a secret Targaryen loyalist this entire time, only feigning peace while planning to betray the Lannisters. In his final chapter with his daughter and heir Arianne Martell (also cut from the TV series) he explains this and says that he is sending envoys to Slaver's Bay, to bring their heart's desire (this line was given to Ellaria in the TV version). Arianne then asks him what he means, at which he quotes the Targaryen motto \"Fire and Blood\" - these lines were shifted to Varys in the TV version. In the novels, Ellaria is actually against the idea of going to war with the Lannisters, fearing she may lose more family members, while Arianne and the Sand Snakes push for war, but in ways that do not involve harming Myrcella, as she is innocent of any crime. The television series has essentially swapped Doran's and Ellaria's roles, depicting them and the Sand Snakes in a substantially more negative light than in the novels, since Doran is portrayed as a somewhat ineffective ruler with no intention of avenging his sister at least, while Ellaria and the Sand Snakes are depicted as willing to murder innocent people to get what they want, to the point that the Sand Snakes appear to enjoy killing or tormenting people just for the fun of it, and Ellaria, apparently maddened by her desire to avenge Oberyn, is willing to murder Oberyn's own brother and nephew in the process.",
              "elements": []
            },
            {
              "text": "Olenna remarks that the last time a Tyrell came to Dorne he was assassinated, with 100 red scorpions. This refers to Lyonel Tyrell, who has been mentioned before in the animated Histories & Lore featurettes, and lived about 140 years ago. During the Conquest of Dorne, the young King Daeron I Targaryen managed to subdue the Martells through a brilliant military campaign, but this was followed by a bitter Dornish insurgency which costs many thousands more men due to attrition. Daeron I left Lord Lyonel Tyrell behind as governor of occupied Dorne, but the Dornish so hated his rule that one day they laid a trap which dumped over a hundred poisonous scorpions onto his bed, killing him.",
              "elements": [
                {
                  "text": "Culturally the Reachmen and Dornishmen have been enemies for centuries, as have the Dornishmen and the Stormlanders' Marcher lords. This resentment is given more focus in the novels, but at the same time, the current generation of Martells hates the Lannisters far more for killing Elia, and both the Tyrells and Martells ironically ended up fighting on the Targaryen side in Robert's Rebellion. It was a simmering cultural resentment but didn't affect their major actions. The TV show removed much of this from when Oberyn Martell appears in King's Landing in Season 4 because due to time limitations they wanted to focus on the far more prominent Martell-Lannister rivalry. Nonetheless, this explains some of Olenna's brusk attitude towards Ellaria and the Sand Snakes: the Dornish have very relaxed attitudes about bastardy but the Reachmen do not, and all of them are bastards. On top of that, in the books, Olenna looked down on Ellaria for being Oberyn's unmarried paramour, which she bluntly felt meant Ellaria was a whore. Of course, in the TV version, Olenna is more immediately upset that Ellaria and the Sand Snakes murdered Prince Doran and his son, an act of betrayal and kinslaying.",
                  "elements": []
                }
              ]
            },
            {
              "text": "Two episodes ago Varys was shown leaving Meereen in a ship to head back to Westeros, explaining he was going to woo potential allies there. In the novels, it wasn't really clear where Varys went after Tyrion killed Tywin Lannister: he didn't appear again when Tyrion was let out of his crate in Pentos, nor did he travel to Meereen. Varys does reappear later in Westeros, but it is unclear if he traveled east to the Free Cities and then returned, or if he was in hiding in Westeros the entire time, still orchestrating his spy network.",
              "elements": []
            },
            {
              "text": "In the books, it is actually Varys who kills Kevan Lannister and Pycelle, using his Little birds, in the epilogue of the fifth novel. He sneaks back into the Red Keep - or perhaps was hiding in the secret passages the entire time? - and smashes Pycelle's head in from behind as he sits at his desk. Kevan later arrives in the room and Varys shoots him with a crossbow, mortally wounding him. Varys then apologizes to Kevan that he's a good man who happens to be supporting the wrong side and he bears him no ill will. He explains that Kevan and Pycelle were doing too good of a job of undoing the damage which Cersei had caused the Lannister faction - and not only is he removing them, but he will frame their deaths on the Tyrells, further driving a wedge between Cersei and her few potential remaining allies. Varys then has his little birds come in and finish off the wounded Kevan. The TV version shifted this around so that Kevan dies in the Great Sept, while Pycelle gets more or less the same death he did in the book version - but in this case ordered by Varys's replacement Qyburn, and ultimately Cersei. It does make sense that Cersei would kill Pycelle in a purge, given that even he abandoned her and brought Kevan back to King's Landing to rule after he realized that Cersei's inept leadership was running the crown into the ground. Later parts of Varys's activities in the next novel will probably involve trying to court Dorne as an ally.",
              "elements": []
            },
            {
              "text": "The Reach and Dorne were the two kingdoms in Westeros which actually fought on the Targaryen side during Robert's Rebellion. The Dornish still actively hate the Lannisters for what they did killing Rhaegar Targaryen and Elia Martell's children during the war. The Reach fought for the Targaryens because they thought they owed their position to them (and thought the rebels were more likely to lose). This time, however, the North and the Vale aren't helping the Iron Throne, nor are most of the Iron Islands under Euron, and the Iron Fleet under Yara herself is actively assisting the Targaryens.",
              "elements": []
            },
            {
              "text": "Tyrion Lannister might not react well when their fleet meets up with their new Dornish allies; Ellaria and the Sand Snakes killed his niece Myrcella, and Tyrion actually loved her (and was loved by her), saying his niece was a sweet and innocent girl who was nothing like her mother.",
              "elements": []
            }
          ]
        }
      ],
      "images": []
    },
    {
      "title": "In Meereen",
      "level": 3,
      "content": [
        {
          "type": "list",
          "elements": [
            {
              "text": "Tyrion Lannister has now been formally named as Daenerys Targaryen's Hand of the Queen. The title shifts from \"King\" to \"Queen\" if the current monarch is female, as seen with previous references to Daenerys's \"Queensguard\" (Kingsguard).",
              "elements": [
                {
                  "text": "Tyrion is now Hand of the King/Queen to Daenerys just as his father Tywin was Hand of the King to Daenery's father Aerys II.",
                  "elements": []
                },
                {
                  "text": "It is unclear if she also named Yara Greyjoy as her new Master of Ships on the rival Small Council she is forming. It's possible she didn't, given that Yara seeks independence for the Iron Islands..",
                  "elements": []
                },
                {
                  "text": "Varys stands immediately behind Daenerys, next to Missandei. Whether he is formally her Master of Whisperers or not, it is clear that she has gotten over her suspicions of him (which she voiced to Tyrion before, as he arrived in Meereen only after she left).",
                  "elements": []
                }
              ]
            },
            {
              "text": "As Daenerys directly explains, her followers have renamed \"Slaver's Bay\" as the \"Bay of Dragons\", because with slavery being abolished the old name doesn't really fit anymore. In ancient times this actually was the heart of the Valyrian Freehold as they flew dragons over the bay to conquer the Ghiscari Empire - so the bay has seen a large number of dragons throughout history, making it appropriate even if not a direct reference to the Second Siege of Meereen's conclusion.",
              "elements": []
            },
            {
              "text": "In the episode, while breaking up with Daario Naharis, Daenerys insists that no one put her up to it. In the \"Inside the Episode\" featurette, however, Benioff says that Tyrion actually did bring this up to Daenerys - but Benioff also stressed that Tyrion didn't \"manipulate\" Daenerys in any way, and the choice was entirely her own: Tyrion simply pointed out to her a very obvious and logical question of how she would tempt the Great Houses in Westeros with offers of a political marriage-alliance if she brought along her foreign sellsword consort. She realized things with Daario simply wouldn't work out given her future needs, and decided on her own to leave him behind in Meereen.",
              "elements": []
            },
            {
              "text": "Daenerys previously dressed in bright blue riding outfits, because blue is the Dothraki power color (as it is their most expensive color dye). Then in Season 5 she shifted to white dresses, to emphasize how removed and above it all she seems from the sectarian violence in Meereen. By the end of this episode, Daenerys is wearing the same cut of dress she wore in Season 5, but now in all black - from the red and black colors of the Targaryen heraldry. Apparently this signifies Daenerys embracing her legacy as a Targaryen and a conqueror as she sails back to Westeros. See \"Costumes: Major Characters - Daenerys Targaryen\" for more information.",
              "elements": []
            },
            {
              "text": "The leaders of all four of the Great Houses that make up armies in Daenerys's faction now are women: Daenerys herself for House Targaryen, Yara Greyjoy and her faction of House Greyjoy, Olenna for House Tyrell, and Ellaria Sand for Dorne. Meanwhile, the Lannisters are now also formally led by a woman as Cersei has not only killed her uncle Kevan but openly seized power and declared herself ruling Queen.",
              "elements": []
            },
            {
              "text": "It is unclear how Varys could travel so quickly between Meereen a few episodes ago to Dorne, then from Dorne back to Meereen in this same episode. However, the closing scene implies that some time has passed, and also, the fact that ships with Tyrell and Martell sails are with Daenerys's fleet somewhat implies that there has been a time jump and they are near Westeros's waters in this closing shot (as we don't actually see \"Meereen\", they are on the open ocean). For all we know Varys took a Martell ship heading east which rendezvoused with Daenerys's fleet heading west somewhere south of the Free Cities.",
              "elements": [
                {
                  "text": "It is unclear why Varys would leave Westeros to rejoin Daenerys when she is headed there anyway - the TV show probably just wanted a large scale closing shot of Daenerys with her full fleet and all her allies, a preview of what's coming next season.",
                  "elements": []
                },
                {
                  "text": "The ships with Tyrell banners in Daenerys's fleet in the closing shot may in fact be part of the Redwyne Fleet.",
                  "elements": []
                },
                {
                  "text": "In Daenerys's fleet, Dothraki can be seen working on the ships. In the Season 3 premiere \"Valar Dohaeris\", however, the Dothraki that Dany had brought with her became violently seasick, as Dothraki have never sailed or ridden on ships before - they fear and avoid the ocean. Thus, it is surprising that not only are the Dothraki in Daenerys's fleet not seasick, many of them are working as ship hands. One explanation could be that this is another indication that a significant amount of time has passed since they left Mereen by the time of this closing shot, so the Dothraki could have gotten adjusted to the sea by then.",
                  "elements": []
                }
              ]
            },
            {
              "text": "Although Daenerys and her army are now sailing to Westeros, it is unclear where in Westeros they are going to land. One possibility is that they are sailing to King's Landing to lay siege to the city, as Stannis Baratheon did in the Battle of the Blackwater. This is a rather risky move, however, and a more likely possibility is that they are sailing to Dorne or the Reach, where they could safely land, unload their ships, prepare their army, and then march on King's Landing. Most probably they are going to land in Dorne, given that it is the closest part of Westeros to Meereen.",
              "elements": []
            }
          ]
        }
      ],
      "images": []
    },
    {
      "title": "In the books",
      "level": 2,
      "content": [
        {
          "type": "list",
          "elements": [
            {
              "text": "The episode seems to be adapted from the following chapters of A Storm of Swords:",
              "elements": [
                {
                  "text": "Epilogue: Members of House Frey fall victims of assassination by a vengeful member of House Stark believed to be dead.",
                  "elements": []
                }
              ]
            },
            {
              "text": "The episode is adapted from the following chapters of A Feast for Crows:",
              "elements": [
                {
                  "text": "Chapter 40, The Princess in the Tower: The ruler of Dorne reveals he's aligned with House Targaryen and that its time for \"Vengeance. Justice. Fire and blood.\"",
                  "elements": []
                },
                {
                  "text": "Chapter 45, Samwell V: Samwell Tarly arrives at the Citadel and has to deal with a bureacrat of the Order of Maesters.",
                  "elements": []
                }
              ]
            }
          ]
        },
        {
          "type": "list",
          "elements": [
            {
              "text": "The episode is adapted from the following chapters of A Dance with Dragons:",
              "elements": [
                {
                  "text": "Chapter 19, Davos III: Davos Seaworth and Lord Wyman Manderly witness a young northern noblewoman deliver a moving speech about loyalty to House Stark.",
                  "elements": []
                },
                {
                  "text": "Chapter 24: Davos IV: Lord Wyman Manderly confirms his loyalty to House Stark.",
                  "elements": []
                },
                {
                  "text": "Chapter 37, The Prince of Winterfell: Meat pies - made out missing Freys - are served by a member of the northern nobility to other Freys in revenge for the Red Wedding.",
                  "elements": []
                },
                {
                  "text": "Epilogue: Grand Maester Pycelle is killed. Varys's little birds stab a member of the Small Council to death. The master of the little birds tells their victims that he doesn't bear any ill will towards their victim and that he doesn't deserve to die alone. Ser Kevan Lannister is killed. Varys is back in Westeros to pave the way for the restoration of House Targaryen. White ravens sent by the Citadel arrive on a major castle, confirming that winter has arrived.",
                  "elements": []
                }
              ]
            }
          ]
        },
        {
          "type": "list",
          "elements": [
            {
              "text": "The rest of the episode appears to draw material from what will come in the sixth novel, The Winds of Winter.",
              "elements": []
            }
          ]
        }
      ],
      "images": []
    },
    {
      "title": "Memorable quotes",
      "level": 2,
      "content": [
        {
          "type": "paragraph",
          "text": "Cersei Lannister: \"Your gods have forsaken you. This is your god now.\""
        },
        {
          "type": "paragraph",
          "text": "Margaery Tyrell: \"Forget about the bloody Gods and listen to what I am telling you.\""
        },
        {
          "type": "paragraph",
          "text": "Lyanna Mormont: \"House Mormont remembers, The North remembers.\""
        },
        {
          "type": "paragraph",
          "text": "Lyanna Stark: \"His name is [...] If Robert finds out, he'll kill him! You know he will! You have to protect him. Promise me Ned! Promise me!\""
        },
        {
          "type": "paragraph",
          "text": "Arya Stark: \"My name is Arya Stark. I want you to know that. The last thing you're ever going to see is a Stark smiling down at you as you die.\""
        },
        {
          "type": "paragraph",
          "text": "Jon Snow: The war is not over. And I promise you friends, the true enemy won't wait out the storm. He brings the storm!"
        },
        {
          "type": "paragraph",
          "text": "Qyburn: \"I now proclaim Cersei of the House Lannister, First of Her Name, Queen of the Andals and the First Men, Protector of the Seven Kingdoms. Long may she reign!\""
        },
        {
          "type": "paragraph",
          "text": "Davos Seaworth: \"I loved that girl like she was my own! She was good, she was kind and you killed her!\"\nMelisandre: \"So did her father. So did her mother. Her own blood knew it was the only way!\"\nDavos Seaworth: \"The only way for what?! They all died anyway! You told everyone Stannis was the one, you had him believing it, all of them fooled, and you lied!\"\nMelisandre: \"I didn't lie! I...I was wrong.\"\nDavos Seaworth: \"Aye, you were wrong. And how many died because you were wrong?\""
        }
      ],
      "images": []
    },
    {
      "title": "See also",
      "level": 2,
      "content": [
        {
          "type": "list",
          "elements": [
            {
              "text": "The Winds of Winter on Wikipedia",
              "elements": []
            },
            {
              "text": "The Winds of Winter on IMDb",
              "elements": []
            }
          ]
        }
      ],
      "images": []
    }
  ]
}